[
    {
        "id": "featured-project-lingoai",
        "title": "Lingo.ai",
        "year": "July 2024 - August 2024",
        "team": "5-member team project",
        "demo": "https://lingo-ai.carmenshiu.com/",
        "github": "https://github.com/athena-codes/a-A-summer-hackathon",
        "tags": [
            "Node.js",
            "JavaScript",
            "Express.js",
            "Firebase",
            "Gemini AI",
            "React",
            "Redux",
            "Material UI (MUI)"
        ],
        "description": "🏆 Second Place - App Academy Summer 2024 Hackathon: AI for Social Good\n An LLM-powered flashcard web application for non-native English speakers to enhance their skills through interactive AI-generated questions.",
        "image": "/assets/featured-projects/lingoai.webp",
        "jpg": "/assets/featured-projects/lingoai.png",
        "highlights": [
            "Spearheaded frontend development by designing and implementing UI components with Material UI, ensuring a seamless user experience",
            "Collaborated on AI prompting refinement with Gemini AI, enhancing user learning",
            "Conducted quality assurance (QA) by testing backend routes with Postman and troubleshooting frontend issues",
            "Optimized Firebase Firestore configurations and data handling to improve app performance"
        ]
    },
    {
        "id": "featured-project-plantera",
        "title": "Plantera",
        "year": "April 2024 - November 2024",
        "team": "Solo project",
        "demo": "https://plantera.carmenshiu.com",
        "github": "https://github.com/craftycarmen/plantera",
        "tags": [
            "Node.js",
            "JavaScript",
            "Express.js",
            "PostgreSQL",
            "Sequelize",
            "React",
            "Redux",
            "HTML5",
            "CSS3",
            "Amazon Web Services (AWS)",
            "Stripe"
        ],
        "description": "A plant marketplace community platform where plant enthusiasts come together to shop and sell plants, and inspire others with plant care guides.",
        "image": "/assets/featured-projects/plantera.webp",
        "jpg": "/assets/featured-projects/plantera.png",
        "highlights": [
            "Engineered RESTful API endpoints with Express.js to streamline client-server communication",
            "Built a persistent shopping cart feature with Redux and Web Storage API, maintaining data across sessions",
            "Designed search and filter functionality to help users easily browse and find plants",
            "Incorporated Quill rich-text editor to allow users to create and publish plant-related articles",
            "Established custom user authentication with bcrypt and React routes, effectively managing user access",
            "Configured Stripe for easy, secure payment processing"
        ]
    },
    {
        "id": "featured-project-thepaw",
        "title": "The Paw",
        "year": "March 2024 - August 2024",
        "team": "3-member team project",
        "tags": [
            "Python",
            "Flask",
            "JavaScript",
            "PostgreSQL",
            "React",
            "Redux",
            "HTML5",
            "CSS3",
            "Amazon Web Services (AWS)",
            "Google Maps API"
        ],
        "demo": "https://thepaw.carmenshiu.com/",
        "github": "https://github.com/ballisticbutterflies/The-Paw",
        "description": "A pet-friendly business review platform for businesses to showcase their services, and pet owners to share their experiences.",
        "image": "/assets/featured-projects/thepaw.webp",
        "jpg": "/assets/featured-projects/thepaw.png",
        "highlights": [
            "Led frontend development, setting up an efficient Git workflow for optimized collaboration and version control",
            "Developed the backend with Python and Flask, handling server-side logic and data processing",
            "Designed a mobile-first, responsive UI with React for viewing business details, adding reviews, and uploading photos",
            "Integrated Amazon Web Services (AWS) S3 for efficient photo management and storage"
        ]
    }
]
